<template>
   <div>
      <h2 class="rounded-border">Криптография</h2>

      <p>Криптография – это наука, изучающая разные способы и методы шифрования данных. Для защиты передаваемой информации используются специальные алгоритмы, которые, с помощью набора неких правил, производят шифровку.</p>

      <p>Шифр – набор инструментов для засекречивания сообщения с целью защиты.</p>
      <p>Ключ – данные, с помощью которых осуществляется зашифровка и расшифровка посланий.</p>

   </div>
</template>

<script>

</script>

<style scoped>
   h2 {
      display: inline;
   }
   p {
      font-size: 20px;
      text-align: justify;
      text-indent: 30px;
      line-height: 30px;
   }
</style>